# 环境参数
S_dim = 15  # 文件个数 15
cache_space = 4  # 缓存空间大小 4
Stop_number = 200  # 仿真请求总数 200
Zipf_w = 1  # 流行度变化幅度 1
Zipf_step = 2  # zipf分布变化步长 2
Zipf_alpha = 0.6  # zipf分布参数 0.6
Zipf_baseline = 0.062  # 低于某个阈值的内容不会被请求 0.062
Baseline = 50  # 奖励持续基线 50
file_w = [0.1, 0.9, 0.5]  # 0.1, 0.9, 0.5
file_scale = [20000, 70000]  # 文件大小缩放范围 20000, 70000

# fifo lfu rc dqn
request_num = [10, 20, 30, 40, 50, 60, 70, 80]
fifo = [0.27, 0.55, 0.520, 0.532, 0.521, 0.51, 0.50, 0.49, 0.47]
lfu = [0.25, 0.32, 0.52, 0.56, 0.55, 0.57, 0.53, 0.52, 0.50]
rc = [0.26, 0.27, 0.27, 0.268, 0.270, 0.272, 0.267, 0.261, 0.263]
dqn = [0.82, 0.86, 0.85, 0.83, 0.81, 0.80, 0.77, 0.78, 0.77]
