# 环境参数
S_dim = 15  # 文件个数
cache_space = 4  # 缓存空间大小
Stop_number = 200  # 仿真请求总数
Zipf_w = 1  # 流行度变化幅度
Zipf_step = 2  # zipf分布变化步长
Zipf_alpha = 0.6  # zipf分布参数
Zipf_baseline = 0.062  # 低于某个阈值的内容不会被请求
Baseline = 50  # 奖励持续基线
file_w = [0.1, 0.9, 0.5]
file_scale = [20000, 70000]  # 文件大小缩放范围

# fifo lfu rc dqn
request_num = [10, 20, 30, 40, 50, 60, 70, 80]
fifo = [4.42, 77.79, 162.20, 249.30, 338.09, 416.34, 504.37, 593.51]
lfu = [4.20, 97.07, 163.71, 240.62, 326.33, 397.65, 481.83, 567.74]
rc = [4.35, 100.50, 204.52, 310.72, 419.16, 520.22, 624.60, 732.49]
dqn = [4.59, 50.35, 99.8, 162.16, 198.84, 218.63, 261.70, 320.28]
