# 环境参数
S_dim = 15  # 文件个数
cache_space = 4  # 缓存空间大小
Stop_number = 200  # 仿真请求总数
Request_number = 30  # 一次请求个数起始
Request_number_max = 50  # 一次请求个数上限
Zipf_w = 1  # 流行度变化幅度
Zipf_step = 2  # zipf分布变化步长
Zipf_baseline = 0.062  # 低于某个阈值的内容不会被请求
Baseline = 50  # 奖励持续基线

Zipf_alpha = [0.5, 0.55, 0.6, 0.65, 0.7, 0.75, 0.8, 0.85, 0.9]
fifo = [0.473, 0.480, 0.520, 0.532, 0.541, 0.547, 0.557, 0.568, 0.589]
lfu = [0.477, 0.486, 0.560, 0.577, 0.592, 0.600, 0.607, 0.617, 0.629]
rc = [0.268, 0.267, 0.270, 0.263, 0.269, 0.269, 0.258, 0.266, 0.267]
dqn = [0.762, 0.767, 0.779, 0.820, 0.842, 0.855, 0.877, 0.889, 0.891]

